<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    A <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    Comandos para <u><b>Correção</b></u> e <b><u>Remoção</u></b> de tuplas <br>
    </font>
<div align="right"><font size="1" face="arial" color="gray">20 cel</font></div>

<br>

**Objetivo:** Explorar comandos básicos da linguagem sub-linguagem de manipulaçào de dados em SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
  * Explorar o comando `UPDATE`
  * Explorar os comandos `DELETE` e `TRUNCATE`

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [ ]:
# Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine
from pgspecial.main import PGSpecial
from pgspecial.namedqueries import NamedQueries

# Conectar com um servidor SQL na base Alunos 15 --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:postgres@localhost/alunos15')
%sql postgresql://postgres:postgres@localhost/alunos15

<br><br>

----

<br>

Vamos também "limpar" a base de qualquer tabela que possa ter sido criada em execuções anteriores deste _notebook_:

In [ ]:
%%sql
DROP TABLE IF EXISTS Aluno2, Turma2, Matricula2, Prova CASCADE;
DROP TABLE IF EXISTS T1, T2, T3 CASCADE;

<br><br>

----

<br>

## 2. O Comando `UPDATE`

O comando <b><font size="3" face="courier" color="blue">UPDATE</font></b> é usado para corrigir &mdash; <u><b>atualizar</b></u> &mdash;  tuplas que já existem em uma relação.\
Sua ação é a de modificar valores de um ou mais atributos em cada tupla que atende a alguma condição.\
Ele não altera a quantidade de tuplas que existem na tabela.

A sintaxe geral do comando `UPDATE` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
UPDATE $<$Tabela$>$ <br>
    &emsp; SET $<$Atributo$>$ =$<$expressão$>$[, ...]<br>
    &emsp; [FROM $<$Tabelas$>$]<br>
    &emsp; [WHERE $<$Condição$>$]<br>
    &emsp; ;</font></b>
</div>

Onde 
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
$<$expressão$>$ = $<$Atr_expr$>$ | $<$Sel_expr$>$ | $<$constante$>$ | DEFAULT<br>
</font></b></div>

  * <b><font size="3" face="courier" color="blue">$<$Atributo$>$</font></b>< é o atributo que recebe o resultado da atribuição.\</b></font>\
    Pode ser um atributo único ou uma expressão de tupla na forma <b><font size="3" face="courier" color="blue">(Atr1, Atr2,...)
  * <b><font size="3" face="courier" color="blue">$<$Atr_expr$>$</font></b> é
     qualquer expressão usando os atributos da(s) tabela(s) disponível para consulta.
  * <b><font size="3" face="courier" color="blue">$<$Sel_expr$>$</font></b> é
     qualquer comando SELECT que resulte em apenas uma tupla e\
     &emsp; <font size="5">&#9758;</font> com a mesma quantidade de atributos que devem ser atualizados nessa mesma expressão de attribuicão. <font size="5">&#9756;</font>.
  * <b><font size="3" face="courier" color="blue">$<$Tabela$>$</font></b> é a tabela a ser modificada.
  * <b><font size="3" face="courier" color="blue">$<$Tabelas$>$</font></b> é uma lista de uma ou mais tabelas que podem ser mencionadas
     * em condiçõe da cláusula `WHERE`
     * ou em consultas correlacionadas em _subselects_.
  * <b><font size="3" face="courier" color="blue">$<$Condição$>$</font></b> é
      uma condição que seleciona as tuplas a serem atualizadas.
  * <b><font size="3" face="courier" color="blue">$<$expressão$>$</font></b> sempre usa o estado original da tabela:\
    Todas as atualizações são colocadas de uma vez só na tupla depois que todas as expressões houverem sido calculadas.
    * Não existe garantia da ordem em que as expressões são calculadas.\
      Cuidado com o uso de funções que tenham efeitos colaterais.

<br>

Por exemplo:\
<i>Aumentar de uma unidade a idade de todos os alunos.</i>:

In [ ]:
%sql DROP TABLE IF EXISTS Aluno2;
%sql CREATE TABLE Aluno2 AS TABLE Aluno;
%sql Antes << SELECT * FROM Aluno2 WHERE Cidade ~*'S.*Carlos';

%sql UPDATE Aluno2         \
         SET Idade=Idade+1;

%sql Depois << SELECT * FROM Aluno2 WHERE Cidade ~*'S.*Carlos';

print('Antes:\n', Antes, sep='')
print('\n\nDepois:\n',Depois, sep='')

Veja que, como não foi colocada uma cláusula `WHERE`, todas as tuplas da tabela foram atualizadas.\
Nesse exemplo, estamos <b>mostrando</b> apenas as tuplas dos alunos de São Carlos,\
 &emsp; a cláusula `WHERE` está no comando `SELECT`.\
 &emsp; &emsp; <font size="4">&#128073;</font> Mas o comando `UPDATE` atualizou todas as tuplas da tabela &emsp; <font size="4">&#128072;</font>

<br><br>

----

<br><br>


Exemplo:\
<i>Atualizar a turma de `Codigo=101` na relação `Turma`,\
contando quantas `Matrículas` existem de fato para essa turma na relação de `Matrículas`
</i>:

In [ ]:
%sql DROP TABLE IF EXISTS Turma2;
%sql CREATE TABLE Turma2 AS TABLE Turma;
%sql Antes << SELECT * FROM Turma2;
%sql Matric << SELECT * FROM Matricula;

%sql UPDATE Turma2                                             \
         SET NNAlunos=(                                        \
                       SELECT count(*)                         \
                           FROM Matricula                      \
                           WHERE codigoTurma=101)              \
         WHERE Codigo=101;

%sql Depois << SELECT * FROM Turma2;

print('Antes:\n', Antes, sep='')
print('\n\nMatriculas:\n', Matric, sep='')
print('\n\nDepois:\n', Depois, sep='')

Veja que o atributo `Codigo` é chave em `Turma`, \
portanto apenas uma tupla da tabela foi atualizada.

<br><br>

----

<br><br>

Exemplo:\
<i>Atualizar todas as tuplas da relação `Turma`,\
contando quantas matrículas existem em cada `Turma` na relação de `Matrículas`.<i>

In [ ]:
%%sql
UPDATE Turma2 T
    SET NNAlunos= (SELECT count(*)
                       FROM Matricula M
                       WHERE M.CodigoTurma=T.Codigo
                   )
        -- Sem cláusula WHERE!
    ;

SELECT * 
    FROM Turma2
    ORDER BY Sigla;

<b>NOTA:</b><br>
  * Com a omissão da cláusula `WHERE` do comando `UPDATE`,\
     todas as tuplas da relação `Turma` são atualizadas.
  * A contagem de Alunos numa turma que não tem nenhuma tupla em `Matrícula` é zero.

<br><br>

----

<br><br>

Vamos modificar a relação de matrículas para que ela inclua as notas das provas 1 e 2 e a nota final,\
e vamos assumir que exista uma relação com as notas da prova 2 qualquer de uma determinada turma:

<div class=”square” style="background-color:#B0B0FF;"><font size="4" face="courier" color="black"><strong>
Matricula={<u>CodigoTurma, NUSP</u>, Prova1, Prova2, NotaFinal}<br>
Prova={<u>CodigoTurma, NUSP</u>, Nota}
</strong></div>

<br>

Para exemplificar,
  * vamos criar a nova relação de `Matrículas`
  * Assumindo que a `Nota` que existe na relação atual corresponde à `Prova1`,
  * e vamos _chutar_ que a `Turma = 100` já tenha notas da `Prova2` atribuída:

In [ ]:
%%sql
DROP TABLE IF EXISTS Matricula2;
CREATE TABLE Matricula2 AS 
    SELECT  CodigoTurma, NUsp, Nota::Decimal(5,2) Prova1, NULL::Decimal(5,2) Prova2, NULL::Decimal(5,2) NotaFinal
        FROM Matricula;

UPDATE Matricula2
    SET Prova2=Random()*10
    WHERE CodigoTurma=100;

UPDATE Matricula2
    SET NotaFinal=(Prova1 + Prova2)/2;

SELECT *
    FROM Matricula2 
    WHERE CodigoTurma IN (100, 101, 105)
    ORDER BY CodigoTurma, NUSP;

<br>

  * Veja que o cálculo da `NotaFinal` deve ser feito usando o novo valor da `Prova2`.\
    Então, só podemos usar esse valor depois que o `UPDATE` já houver sido finalizado.\
    Se houvessemos usado apenas um comando `UPDATE` com duas cláusulas `SET`, \
        &emsp; &emsp; a segunda expressão teria usado o valor antigo do atributo `Prova2`, o que estaria errado.

<br><br>

----

<br><br>


Outro exemplo:\
Vamos criar uma tabela separada que contenha as notas obtidas em uma determinada prova de uma turma:

In [ ]:
%%sql
DROP TABLE IF EXISTS Prova;
CREATE TABLE Prova(
    Codigoturma DECIMAL(4)  NOT NULL,
    NUSP        DECIMAL(8)  NOT NULL,
    Nota        DECIMAL(5,2)
    );


INSERT INTO Prova VALUES (101, 2345, 6.6);
INSERT INTO Prova VALUES (101, 3456, 4.2);
INSERT INTO Prova VALUES (101, 2344, 5);
INSERT INTO Prova VALUES (101, 4567, 5.5);
INSERT INTO Prova VALUES (101, 6789, 6);
INSERT INTO Prova VALUES (101, 7890, 9.5);
INSERT INTO Prova VALUES (101, 8901, 8);
INSERT INTO Prova VALUES (101, 9012, 8);
-- INSERT INTO Prova VALUES (101, 1234)   -- Não fez a Prova
INSERT INTO Prova VALUES (101, 5678, 8);  -- Não está matriculado na turma 101

SELECT * FROM Prova
    ORDER BY 2;

Agora podemos "mesclar" as duas tabelas:
  * atualizar a `Prova2` das `Matriculas`
  * considerando o `NUSP` dos alunos que fizeram a prova, e\
    atualizando apenas as tuplas da `Matricula` que tem o `NUSP`

Note neste exemplo, que podemos atualizar um atributo por vez com cláusulas `SET` específicas,\
    &emsp; ou podemos usar a notação de tuplas (entre parênteses) para atualizar diverso atributos num mesmo `SET`.\
    &emsp; &starf; Neste caso, como os valores podem ambos ser obtidos numa mesma sub-consulta,\
    &emsp; &emsp; é mais simples usar a notação de tuplas.

In [ ]:
%%sql
UPDATE Matricula2 M
    SET (Prova2, NotaFinal) = (SELECT Distinct P.Nota, (P.Nota+M.Prova1)/2.0
                                   FROM Prova P
                                   WHERE P.codigoTurma=M.codigoTurma AND
                                         P.NUSP=M.NUSP
                               )
    WHERE EXISTS (SELECT 1 
                      FROM Prova P
                      WHERE P.codigoTurma=M.codigoTurma AND
                            P.NUSP=M.NUSP
                 );

SELECT *
    FROM Matricula2 
    WHERE CodigoTurma IN (100, 101, 105)
    ORDER BY CodigoTurma, NUSP;

Note que:
  * `Alunos` que fizeram prova (têm nota em `Prova`) \
    mas não têm a matricula correspondente (a chave primária de `Matricula`: `Sigla`+`NUSP`) na tabela de `matriculas`\
    não têm nenhuma tupla atualizada &mdash; a tupla não existe.\
     &emsp;  &star; é o caso do `NUSP=5678` em `Prova`, que não tem correspondente na `Matricula`.
  * `Alunos` que não fizeram prova (não tem a nota em `Prova`)\
    também não são atualizados na `Matrícula`\
     &emsp; &star; é o caso do `NUSP=1234`, que não fez em `Prova`,\
      &emsp; &emsp; e embora presente na `Matricula`, fica sem ser atualizado.


<br><br>

----

<br><br>

### 2.1 Obter as tuplas atualizadas

O comando `UPDATE` admite uma cláusula opcional `RETURNING` que captura as tuplas atualizadas:\
 &emsp; &emsp; &emsp; <font size="4">&#128073;</font>é equivalente à cláusula `INTO` do comando `SELECT`.
 * Ele retorna os valores indicados das tuplas que foram atualizadas, depois da atualização.<br><br>

A sintaxe geral do comando `UPDATE` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
UPDATE $<$Tabela$>$ <br>
    &emsp; SET $<$Atributo$>$) =$<$expressão$>$[, ...]<br>
    &emsp; [FROM $<$Tabelas$>$]<br>
    &emsp; [WHERE $<$Condição$>$]<br>
    &emsp; [RETURNING * | $<$Lista de expressões$>$]\
    &emsp; ;</font></b>
</div>
<br><br>
        
Por exemplo:\
<i> Colocar a `Nota` do aluno com `5.0` se ele estiver com reprovado com nota maior do que `4.75`:</i>

In [ ]:
%%sql 
UPDATE Matricula2
    SET NotaFinal = 5.0
    WHERE NotaFinal<5 AND NotaFinal>=4.75
    RETURNING *;

<br><br>

----

<br><br>

## 3. O Comando `DELETE`

O comando <b><font size="3" face="courier" color="blue">DELETE</font></b> é usado para apagar &mdash; <u><b> remover </b></u> &mdash;  tuplas que já existem em uma relação.\
Sua ação [pode] reduzir a quantidade de tuplas que existem em uma tabela.

A sintaxe geral do comando `DELETE` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
DELETE [FROM] $<$Tabela$>$ <br>
    &emsp; [USING $<$Tabelas$>$]<br>
    &emsp; [WHERE $<$Condição$>$]<br>
    &emsp; ;</font></b>
</div>

Onde 

  * <b><font size="3" face="courier" color="blue">$<$Tabela$>$</font></b> é a tabela que terá tuplas removidas.
  * <b><font size="3" face="courier" color="blue">$<$Tabelas$>$</font></b> é uma lista de uma ou mais tabelas que podem ser mencionadas
     * em condiçõe da cláusula `WHERE`
     * ou em consultas correlacionadas em _subselects_.
  * <b><font size="3" face="courier" color="blue">$<$Condição$>$</font></b> é
      uma condição que seleciona as tuplas a serem removidas.

<br>

<br>

Por exemplo:\
<i>Apagar todas as tuplas do `Aluno` com o `NUSP 1489`</i>:

In [ ]:
%sql DROP TABLE IF EXISTS Aluno2;
%sql CREATE TABLE Aluno2 AS TABLE Aluno;

%sql A << SELECT *           \
            FROM Aluno2       \
            WHERE NUSP < 2000  \
            ORDER BY NUSP;

%sql DELETE FROM Aluno2    \
            WHERE NUSP=1489;

%sql D << SELECT *           \
            FROM Aluno2       \
            WHERE NUSP < 2000  \
            ORDER BY NUSP;

print('Antes:\n', A, sep='')
print('\n\nDepois:\n', D, sep='')

<br><br>

----

<br><br>
Se a condição da cláusula `WHERE` não corresponder a uma tupla só, multiplas tuplas podem ser removidas:

Exemplo:\
<i>Remover todos os Alunos em que o atributo Cidade tem o valor indicado.</i>\
 &emsp; Veja na resposta ao comando a quantidade de tuplas afetadas: (removidas)

In [ ]:
%%sql
DELETE FROM Aluno2
    WHERE Cidade = 'Rio Claro';
DELETE FROM Aluno2
    WHERE Cidade = 'Mirim-Guaçu';

SELECT * 
    FROM Aluno2
    ORDER BY Cidade;

<font color="red"><b>ATENÇÃO:</b></font>\
O comando <b><font size="2" face="Verdana" color="blue">DELETE</font></b>, como todos os outros, executa o comando de maneira definitiva.

Para apagar todas as tuplas de uma relação, basta pedir:

In [ ]:
%%sql
DELETE FROM Aluno2;

SELECT * FROM Aluno2;

<b>Nota:</b>
 * O comando `DROP TABLE` apaga a definição da relação, junto com todas as suas tuplas.
 * O comando `DELETE FROM` apaga as tuplas indicadas, mesmo que sejam todas,\
   &emsp; Mas não apaga a definição da relação.

<br><br>

----

<br><br>

## 4. O Comando `Truncate`

O comando <b><font size="3" face="courier" color="blue">TRUNCATE</font></b> também é usado para apagar &mdash; <u>remover</u> &mdash;  tuplas que já existem em uma relação.\
A diferença é que o comando `TRUNCATE`:
  * Remove todas as tuplasda tabela &mdash; não existe a cláusula `WHERE`;
  * Não verifica
    * as restrições de integridade associadas,
    * e nem os _triggers_ associados;\
       &mdash; <font color="red">portanto pode deixar a base de dados num estado inconsistente;</font>

A sintaxe do comando `TRUNCATE` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
TRUNCATE [TABLE] $<$Tabela$>$[, ...] <br>
    &emsp; [CASCADE] | [RESTRICT]<br>
    &emsp; ;</font></b>
</div>

<br>

Por exemplo:\
<i>Eliminar todas as tuplas da tabela de  `Aluno`</i>:\
 &emsp; (primeiro vamos garantir que a tabela tenha alunos)

In [ ]:
%%sql
INSERT INTO Aluno2 SELECT * FROM Aluno;

e a seguir remover incondicionalmente todas as tuplas:

In [ ]:
%%sql
TRUNCATE TABLE Aluno2;

Note que o SGBD  não se preocupou nem em contar quantas tuplas foram eliminadas!

<br><br>

<br><br>

----

<br><br>


Principais diferenças entre `DELETE` e `TRUNCATE`:
  * Nenhum altera a "definição" da tabela.

----
  * `DELETE` tem a cláusula `WHERE`, portanto podem ser apagadas apenas algumas tuplas da tabela;
  * `TRUNCATE` não tem cláusula `WHERE`, todas as tuplas são apagadas;

----
  * `DELETE` realiza um travamento por tupla, e <b>avalia as restrições de integridade</b> e `TRIGGERS` de cada tupla;
  * `TRUNCATE` realiza um travamento de toda a tabela, e avalia as restrições de integridade apenas pela definição.\
    &emsp;  Ele não executa `TRIGGERS`;
  * Portanto, em tabelas com muitas tuplas, `TRUNCATE` é significativamente mais rápido e reduz o _log_ das operações

----
  * Caso alguma tabela tenha atributos como chave estrangeira apontando para esta tabela (cláusula `ON DELETE CASCADE`): 
    * `DELETE` remove apenas as tuplas que tenham dependência real (tuplas com chave estrangeira nula não são removidas);
    * `TRUNCATE` remove todas as tuplas de ambas as tabelas.\
       Para isso é necessário indicar a clásula `CASCADE`, caso contrário o comando retorna erro.

<br>

Exemplo:\
<b><font size="3" face="courier" color="blue">TRUNCATE TABLE T2 CASCADE;</font></b> -- apaga T2 e T3

In [ ]:
%%sql
DROP TABLE IF EXISTS T1 CASCADE;
DROP TABLE IF EXISTS T2 CASCADE;
DROP TABLE IF EXISTS T3 CASCADE;

CREATE TABLE T1 (
    Id NUMERIC,
    Description VARCHAR(50),
    CONSTRAINT T1_Pk PRIMARY KEY (Id) );
INSERT INTO T1 VALUES(1, 'descricao T1');

CREATE TABLE T2 (
    Id NUMERIC,
    T1_Id NUMERIC,
    Description VARCHAR(50),
    CONSTRAINT T2_Pk PRIMARY KEY (Id),
    CONSTRAINT T2T1_Fk FOREIGN KEY (T1_Id) REFERENCES T1 (Id) ON DELETE CASCADE);
INSERT INTO T2 VALUES(1, 1, 'descricao T2');

CREATE TABLE T3 (
    Id NUMERIC,
    T2_Id NUMERIC,
    Description VARCHAR(50),
    CONSTRAINT T3_Pk PRIMARY KEY (Id),
    CONSTRAINT T3T2_Fk FOREIGN KEY (T2_Id) REFERENCES T2 (Id) ON DELETE CASCADE);
INSERT INTO T3 VALUES(1, 1, 'descricao T3');

In [ ]:
%sql T1 << SELECT * FROM T1;
%sql T2 << SELECT * FROM T2;
%sql T3 << SELECT * FROM T3;

print(T1, '\n\n', T2, '\n\n',  T3, sep='')

In [ ]:
%sql TRUNCATE TABLE T2 CASCADE;   --- Apaga as tuplas de T2 e T3

%sql T1 << SELECT * FROM T1;
%sql T2 << SELECT * FROM T2;
%sql T3 << SELECT * FROM T3;

print(T1, '\n\n', T2, '\n\n',  T3, sep='')

<br>
De novo:

In [ ]:
%%sql
DROP TABLE IF EXISTS T1 CASCADE;
DROP TABLE IF EXISTS T2 CASCADE;
DROP TABLE IF EXISTS T3 CASCADE;

CREATE TABLE T1 (
    Id NUMERIC,
    Description VARCHAR(50),
    CONSTRAINT T1_Pk PRIMARY KEY (Id) );
INSERT INTO T1 VALUES(1, 'descricao T1');

CREATE TABLE T2 (
    Id NUMERIC,
    T1_Id NUMERIC,
    Description VARCHAR(50),
    CONSTRAINT T2_Pk PRIMARY KEY (Id),
    CONSTRAINT T2T1_Fk FOREIGN KEY (T1_Id) REFERENCES T1 (Id) ON DELETE CASCADE);
INSERT INTO T2 VALUES(1, 1, 'descricao T2');

CREATE TABLE T3 (
    Id NUMERIC,
    T2_Id NUMERIC,
    Description VARCHAR(50),
    CONSTRAINT T3_Pk PRIMARY KEY (Id),
    CONSTRAINT T3T2_Fk FOREIGN KEY (T2_Id) REFERENCES T2 (Id) ON DELETE CASCADE);
INSERT INTO T3 VALUES(1, 1, 'descricao T3');


O comando `TRUNCATE TABLE T2 RESTRICT;` \
deve apagar as tuplas de T2 e T3, mas\
<font size="3" color="red">a cláusula `RESTRICT` ocasiona um erro:

In [ ]:
%sql TRUNCATE TABLE T2 RESTRICT;

<b>Nota:</b>
 * Quando o objetivo é ``limpar'' a tabela,\
     <font size="3" color="gree">o comando `TRUNCATE TABLE` é muito mais rápido do que `DELETE TABLE`.</font>
 * Isso é feito deixando de comparar tupla a tupla as restrições de integridade:
   * Se houver chave estrangeira, a restrição é eliminada!

<br><br>

----

<br><br>

Os gerenciadores tratam o comando `TRUNCATE` com algumas diferenças:\
(verifique o comportamento do SGBD que você estiver usando)

<br><br>

Em <img src="Figuras/ISO-Logo.png" width=30> e em <img src="Figuras/Postgres.png" width=100>:\
			O padrão não caracteriza o comando `TRUNCATE` como alheio a transações.\
			Portanto, ele obedece as regras usuais das transações, e o comando pode ser cancelado abortando a transação.

Em <img src="Figuras/Oracle-1.png" width=90>;\
            o comando `TRUNCATE` é caracterizado como alheio a transações.\
			Portanto, depois de executado, as tuplas não podem mais ser recuperadas.

<br><br>

----

<br><br>
<b>Finalizando:</b>\
Os comandos apresentados:
  * `"atualizam"` tuplas já existentes (`UPDATE`) ou
  * `"removem"` tuplas (`DELETE` e `TRUNCATE`)\
 &emsp; &emsp; &emsp; de uma tabela.<br>

<br><br>

----

<br><br>

Podemos agora remover as tabelas que foram usadas nos comandos-exemplo:

In [ ]:
%%sql
DROP TABLE IF EXISTS Aluno2, Turma2, Matricula2, Prova CASCADE;
DROP TABLE IF EXISTS T1, T2, T3 CASCADE;


<br><br>

----

<br><br>

<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    A <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    Comandos para <u><b>Correção</b></u> e <b><u>Remoção</u></b> de tuplas <br>
    </font>